; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-98)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 - object)
 (:init 
    (arm-empty)
    (clear b15)
    (on b15 b17)
    (on b17 b18)
    (on b18 b22)
    (on b22 b21)
    (on-table b21)
    (clear b4)
    (on b4 b23)
    (on b23 b14)
    (on b14 b16)
    (on b16 b2)
    (on-table b2)
    (clear b13)
    (on b13 b7)
    (on b7 b11)
    (on b11 b9)
    (on b9 b27)
    (on b27 b25)
    (on b25 b3)
    (on-table b3)
    (clear b1)
    (on b1 b24)
    (on b24 b5)
    (on b5 b12)
    (on b12 b6)
    (on b6 b19)
    (on b19 b10)
    (on b10 b20)
    (on b20 b26)
    (on-table b26)
    (clear b28)
    (on b28 b8)
    (on b8 b29)
    (on-table b29))
 (:goal (and 
(on b3 b5)
))
)

; plan
1. (unstack b1 b24)
   deleted: (on b1 b24) (clear b1) (arm-empty)
   added: (holding b1) (clear b24)
   goals met: 0 of 1
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
3. (unstack b24 b5)
   deleted: (on b24 b5) (clear b24) (arm-empty)
   added: (holding b24) (clear b5)
   goals met: 0 of 1
4. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 1
5. (unstack b13 b7)
   deleted: (on b13 b7) (clear b13) (arm-empty)
   added: (holding b13) (clear b7)
   goals met: 0 of 1
6. (stack b13 b24)
   deleted: (clear b24) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b24)
   goals met: 0 of 1
7. (unstack b7 b11)
   deleted: (on b7 b11) (clear b7) (arm-empty)
   added: (holding b7) (clear b11)
   goals met: 0 of 1
8. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
9. (unstack b11 b9)
   deleted: (on b11 b9) (clear b11) (arm-empty)
   added: (holding b11) (clear b9)
   goals met: 0 of 1
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 1
11. (unstack b9 b27)
   deleted: (on b9 b27) (clear b9) (arm-empty)
   added: (holding b9) (clear b27)
   goals met: 0 of 1
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
13. (unstack b27 b25)
   deleted: (on b27 b25) (clear b27) (arm-empty)
   added: (holding b27) (clear b25)
   goals met: 0 of 1
14. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 0 of 1
15. (unstack b25 b3)
   deleted: (on b25 b3) (clear b25) (arm-empty)
   added: (holding b25) (clear b3)
   goals met: 0 of 1
16. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 1
17. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 0 of 1
18. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 1 of 1
